Revit 2027 API
PointCloudColorSettings Constructor
Overload List
Name | Description
PointCloudColorSettings() |  Constructs color settings object with default colors.
PointCloudColorSettings(PointCloudColorMode) |  Constructs color settings object with default color for given color mode.
PointCloudColorSettings(PointCloudColorSettings) |  Constructs a copy of source object.
PointCloudColorSettings(Color, Color) |  Constructs color settings object from given colors.
Top
See Also
Reference
PointCloudColorSettings Class
Autodesk.Revit.DB.PointClouds Namespace